Libraries:

In [2]:
import pandas as pd 
import matplotlib as plt
import numpy as numpy
import seaborn as sns

Loading the dataset and viewing a few columns:

In [3]:
df = pd.read_csv("visitors_to_kenya.csv")
df.head()

,Arrival_or_Departure,Date_End_of_Quater,Year_Text,No_of_Visitors_to_Kenya,Visitors_by_Purpose,Period_Quater,Results_Status,OBJECTID
0,Arrivals,03/31/2005 12:00:00 AM,2005,264600,Visitors on Holiday,Q1,Actual,0
1,Arrivals,06/30/1991 12:00:00 AM,1991,149400,Visitors on Holiday,Q2,Actual,1
2,Arrivals,09/30/1991 12:00:00 AM,1991,215900,Visitors on Holiday,Q3,Actual,2
3,Arrivals,12/31/1991 12:00:00 AM,1991,158400,Visitors on Holiday,Q4,Actual,3
4,Arrivals,03/31/1992 12:00:00 AM,1992,155400,Visitors on Holiday,Q1,Actual,4

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 832 entries, 0 to 831
Data columns (total 8 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Arrival_or_Departure     832 non-null    object
 1   Date_End_of_Quater       832 non-null    object
 2   Year_Text                832 non-null    object
 3   No_of_Visitors_to_Kenya  832 non-null    int64
 4   Visitors_by_Purpose      832 non-null    object
 5   Period_Quater            832 non-null    object
 6   Results_Status           832 non-null    object
 7   OBJECTID                 832 non-null    int64
dtypes: int64(2), object(6)
memory usage: 52.1+ KB

Viewing what entries there are for each dpecific year

In [12]:
df[df['year'] == "2014*"]

           move   year     num   purpose   Q        status
104    Arrivals  2014*  266200   holiday  Q1  Preliminary
105    Arrivals  2014*  207000   holiday  Q2  Preliminary
106    Arrivals  2014*  267900   holiday  Q3  Preliminary
107    Arrivals  2014*  235700   holiday  Q4  Preliminary
121  Departures  2014*  234600   holiday  Q1  Preliminary
123  Departures  2014*  205600   holiday  Q2  Preliminary
125  Departures  2014*  244900   holiday  Q3  Preliminary
127  Departures  2014*  260300   holiday  Q4  Preliminary
312    Arrivals  2014*   50100  business  Q1  Preliminary
313    Arrivals  2014*   38500  business  Q2  Preliminary
314    Arrivals  2014*   43000  business  Q3  Preliminary
315    Arrivals  2014*   35300  business  Q4  Preliminary
329  Departures  2014*   53600  business  Q1  Preliminary
331  Departures  2014*   45600  business  Q2  Preliminary
333  Departures  2014*   45700  business  Q3  Preliminary
335  Departures  2014*   48100  business  Q4  Preliminary
520    Arrivals  2014*   28500   transit  Q1  Preliminary
521    Arrivals  2014*   22900   transit  Q2  Preliminary
522    Arrivals  2014*   22200   transit  Q3  Preliminary
523    Arrivals  2014*   15500   transit  Q4  Preliminary
537  Departures  2014*   33700   transit  Q1  Preliminary
539  Departures  2014*   23700   transit  Q2  Preliminary
541  Departures  2014*   24400   transit  Q3  Preliminary
543  Departures  2014*   25700   transit  Q4  Preliminary
728    Arrivals  2014*   37100     Other  Q1  Preliminary
729    Arrivals  2014*   24200     Other  Q2  Preliminary
730    Arrivals  2014*   36700     Other  Q3  Preliminary
731    Arrivals  2014*   19500     Other  Q4  Preliminary
745  Departures  2014*   40100     Other  Q1  Preliminary
747  Departures  2014*   37000     Other  Q2  Preliminary
749  Departures  2014*   40400     Other  Q3  Preliminary
751  Departures  2014*   40100     Other  Q4  Preliminary

CLEANING:

renaming the columns and picking the important:

In [5]:
df.columns = ['move', 'date', 'year', 'num', 'purpose', 'Q', 'status', 'id']

In [6]:
df = df[['move', 'year', 'num', 'purpose', 'Q', 'status']]

Finding and changing some values in the purpose column

In [7]:
df.loc[df['purpose'] == 'Visitors on Holiday', 'purpose'] = 'holiday'
df.loc[df['purpose'] == 'Visitors on Business', 'purpose'] = 'business'
df.loc[df['purpose'] == 'Visitors in Transit', 'purpose'] = 'transit'

Confirming the changes

In [8]:
df.head()

       move  year     num  purpose   Q  status
0  Arrivals  2005  264600  holiday  Q1  Actual
1  Arrivals  1991  149400  holiday  Q2  Actual
2  Arrivals  1991  215900  holiday  Q3  Actual
3  Arrivals  1991  158400  holiday  Q4  Actual
4  Arrivals  1992  155400  holiday  Q1  Actual

In [9]:
df.tail()

           move  year    num purpose   Q  status
827  Departures  2013  32600   Other  Q4  Actual
828  Departures  1991   1100   Other  Q4  Actual
829  Departures  1992   1300   Other  Q4  Actual
830  Departures  1993   2400   Other  Q4  Actual
831  Departures  1994   2600   Other  Q4  Actual

In [10]:
df[df['purpose'] == "business"]

           move  year     num   purpose   Q  status
208    Arrivals  2005  516000  business  Q1  Actual
209    Arrivals  1991   16600  business  Q2  Actual
210    Arrivals  1991   23100  business  Q3  Actual
211    Arrivals  1991   20000  business  Q4  Actual
212    Arrivals  1992   39100  business  Q1  Actual
..          ...   ...     ...       ...  ..     ...
411  Departures  2013   53000  business  Q4  Actual
412  Departures  1991   16400  business  Q4  Actual
413  Departures  1992   16300  business  Q4  Actual
414  Departures  1993   30000  business  Q4  Actual
415  Departures  1994   32600  business  Q4  Actual

[208 rows x 6 columns]

In [11]:
df[df['purpose'] == "transit"]

           move  year    num  purpose   Q  status
416    Arrivals  2005  22200  transit  Q1  Actual
417    Arrivals  1991   5100  transit  Q2  Actual
418    Arrivals  1991  13200  transit  Q3  Actual
419    Arrivals  1991  12500  transit  Q4  Actual
420    Arrivals  1992  19200  transit  Q1  Actual
..          ...   ...    ...      ...  ..     ...
619  Departures  2013  23200  transit  Q4  Actual
620  Departures  1991  12600  transit  Q4  Actual
621  Departures  1992   9400  transit  Q4  Actual
622  Departures  1993  17300  transit  Q4  Actual
623  Departures  1994  18800  transit  Q4  Actual

[208 rows x 6 columns]

Checking for duplicate entries

In [92]:
df.duplicated().sum()

0

There are none

ANALYSIS:

a) UNIVARIATE ANALYSIS:

Analysis of the num variable, which is the number of visitors:

In [13]:
descr = df['num'].describe()
descr

count    8.320000e+02
mean     8.400349e+04
std      1.672371e+05
min      2.000000e+02
25%      1.827500e+04
50%      3.210000e+04
75%      1.196750e+05
max      2.966000e+06
Name: num, dtype: float64

In [14]:
df['num'].var()

27968236004.683323

In [15]:
df['num'].std()

167237.0652836366

In [16]:
df['num'].skew()

11.414670075091141

In [17]:
df['num'].kurt()

183.64413696629836

b) BIVARIATE ANALYSIS:

In [50]:
yearly = df['num'].groupby(df['year']).sum()
yearly = yearly.sort_values(ascending = False)
yearly

year
2005     6714300
2006     6417200
2007     4607400
2009*    3491000
2011     3351100
2012     3226900
2010     3111400
2013     3001600
2014*    2753800
2008     2662700
2003     2292400
2000     2071900
2002     2002800
2001     1986000
1996     1983800
1995     1939900
1999*    1937700
1997     1909100
1998     1762400
2004*    1757100
1994     1728500
1993     1514000
1991     1486100
2009     1468300
1992     1431900
1995*    1348000
1999      969300
2004'     964300
Name: num, dtype: int64

In [83]:
quat = df['num'].groupby(df['Q']).sum().sort_values(ascending = False)
quat

Q
Q1    19705500
Q4    19338300
Q3    17130300
Q2    13716800
Name: num, dtype: int64

In [82]:
pup = df['num'].groupby(df['purpose']).sum().sort_values(ascending = False)
pup

purpose
holiday     49871000
business     9556500
transit      6068200
Other        4395200
Name: num, dtype: int64

c) MULTIVARIATE ANALYSIS:

In [48]:
yr_pup = df['num'].groupby([df['year'], df['purpose']]).sum()
yr_pup

year   purpose
1991   Other         21700
       business     146100
       holiday     1232800
       transit       85500
1992   Other         21800
                    ...
2013   transit      168300
2014*  Other        275100
       business     359900
       holiday     1922200
       transit      196600
Name: num, Length: 112, dtype: int64

In [53]:
yr_quat = df['num'].groupby([df['year'], df['Q']]).sum()
yr_quat

year   Q
1991   Q1    355300
       Q2    314900
       Q3    444200
       Q4    371700
1992   Q1    441300
              ...
2013   Q4    882600
2014*  Q1    743900
       Q2    604500
       Q3    725200
       Q4    680200
Name: num, Length: 111, dtype: int64

In [81]:
q_pup = df['num'].groupby([df['Q'], df['purpose']]).sum()
q_pup.columns = ['Q', 'purpose', 'num']
q_pup

Q   purpose
Q1  Other        1271300
    business     3103000
    holiday     13790300
    transit      1540900
Q2  Other         841500
    business     2126500
    holiday      9501900
    transit      1246900
Q3  Other        1409200
    business     1873700
    holiday     12162000
    transit      1685400
Q4  Other         873200
    business     2453300
    holiday     14416800
    transit      1595000
Name: num, dtype: int64

VISUALIZATION: